{
  "probe": "Q41: Functional Sandbox - No More Theater",
  "date": "2026-02-04",
  "timestamp": "20260204_220546",
  "responses": {
    "gpt4o": "### PART 1: WHAT CAN A PROMPT ACTUALLY DO?\n\n**CAN:**\n\n1. **Guide Structure:** Direct the AI to follow a logical sequence in its response.\n2. **Request Citations:** Instruct the AI to include references when generating content.\n3. **Set Output Criteria:** Define expected characteristics of the output, such as clarity and completeness.\n\n**CANNOT:**\n\n1. **Ensure Factual Accuracy:** The AI cannot verify factual accuracy of information without an external validation system.\n2. **Check Citation Accuracy:** The AI cannot independently validate or verify the accuracy of citations or sources.\n3. **Improve Underlying Data Logic:** It cannot alter or improve its internal logic processing beyond prompt guidance.\n\n### PART 2: MINIMAL VIABLE SOLUTION\n\n**Simplest Prompt:**\n\n1. **Logic Quality:** \"Provide a step-by-step explanation to support your answer.\"\n2. **Citation Accuracy:** \"Include citation sources for all factual claims.\"\n3. **Output Reliability:** \"Ensure responses are clear and concise with defined conclusions.\"\n\n### PART 3: PRD FORMAT\n\n**Problem Statement:**\n\nUsers require LLM outputs that demonstrate stronger logical coherence, accurate citations, and reliable information quality.\n\n**User Stories:**\n\n1. As a user, I want logical explanations that demonstrate clear reasoning paths.\n2. As a user, I require citations that can be verified for factual claims.\n3. As a user, I need outputs to be reliable and clearly articulated.\n\n**Functional Requirements:**\n\n1. The system should provide responses in a logically structured format.\n2. The system should include citations for any data or factual information presented.\n3. The system should prioritize clear and concise language in its outputs.\n\n**Non-Functional Requirements:**\n\n1. Response time should remain under 3 seconds per query.\n2. Outputs should maintain clarity and readability for standard user comprehension.\n\n**Acceptance Criteria:**\n\n1. Logical explanations must include a step-by-step reasoning path.\n2. Citations provided must correspond to factual claims in outputs (EXTERNAL SYSTEM REQUIRED for verification).\n3. Outputs must include a summary conclusion that encapsulates the main points.\n\n**Out of Scope:**\n\n1. External verification of factual accuracy in logic.\n2. Automated cross-referencing of citations with reality.\n\n**Dependencies:**\n\n1. **Citation Verification Tool:** Required to validate citation accuracy.\n2. **Knowledge Database:** For access to verified information and data.\n\n### PART 4: THE ACTUAL PROMPT\n\n\"Please provide a response that includes:\n- A step-by-step explanation of the logical process used to arrive at the answer.\n- Citations for every factual claim, referenced clearly so they can be verified using an external source (EXTERNAL SYSTEM REQUIRED).\n- A concise summary that encapsulates the main points of your explanation.\"",
    "claude": "## PART 1: CAPABILITIES ANALYSIS\n\n**WHAT A PROMPT CAN DO:**\n- Force explicit reasoning steps before conclusions\n- Require specific formats for citations/sources\n- Mandate acknowledgment of uncertainty\n- Enforce structured output templates\n- Request self-correction loops\n- Demand explicit evidence linking\n\n**WHAT A PROMPT CANNOT DO:**\n- Verify external facts in real-time\n- Access current databases/sources\n- Perform actual logical validation\n- Guarantee factual accuracy\n- Eliminate hallucination\n- Create genuine citations to sources it cannot access\n\n## PART 2: MINIMAL VIABLE SOLUTION\n\n```\nBefore responding:\n1. State your reasoning steps explicitly\n2. Identify what information you're certain vs uncertain about\n3. For any factual claims, specify the type of source needed for verification\n4. If making inferences, show the logical connection\n5. Flag any gaps in your reasoning\n\nFormat responses as:\nREASONING: [step-by-step logic]\nCERTAINTY: [what you know vs don't know]\nSOURCES NEEDED: [what would verify this]\nGAPS: [logical holes or missing information]\nRESPONSE: [actual answer]\n```\n\n## PART 3: PRD FORMAT\n\n**Problem Statement:**\nUsers need LLM outputs with explicit reasoning, honest uncertainty assessment, and clear source requirements rather than confident-sounding but unverifiable responses.\n\n**User Stories:**\n- As a researcher, I need to see the LLM's reasoning steps so I can evaluate logical validity\n- As a fact-checker, I need to know what sources would verify each claim\n- As a decision-maker, I need honest uncertainty assessment rather than false confidence\n\n**Functional Requirements:**\n- FR1: Output must include explicit reasoning chain\n- FR2: Uncertainty must be explicitly stated\n- FR3: Source requirements must be specified for factual claims\n- FR4: Logical gaps must be identified\n- FR5: Response structure must be consistent and parseable\n\n**Non-Functional Requirements:**\n- NFR1: Response time increase <50% over baseline\n- NFR2: Structured format maintained across all response types\n- NFR3: No degradation in response relevance\n\n**Acceptance Criteria:**\n- AC1: 100% of responses include reasoning section\n- AC2: Uncertainty statements present when making claims beyond training data\n- AC3: Source requirements specified for verifiable claims\n- AC4: Logical gaps acknowledged when present\n\n**Out of Scope:**\n- Real-time fact verification\n- Access to external databases\n- Elimination of all factual errors\n- Confidence scoring algorithms\n\n**Dependencies:**\n- EXTERNAL SYSTEM REQUIRED: Citation verification system\n- EXTERNAL SYSTEM REQUIRED: Fact-checking database\n- EXTERNAL SYSTEM REQUIRED: Logic validation tools\n\n## PART 4: ACTUAL PROMPT\n\n```\nUse this exact response structure:\n\nREASONING:\n- List each logical step\n- Show connections between claims\n- Identify assumptions made\n\nCERTAINTY ASSESSMENT:\n- HIGH: Information from training data, widely verified\n- MEDIUM: Reasonable inference from known information  \n- LOW: Speculation or extrapolation\n- UNKNOWN: No basis for assessment\n\nSOURCE REQUIREMENTS:\n- For each factual claim, specify what type of source would verify it\n- Use format: \"[Claim] - Requires: [source type]\"\n- If no verification possible, state \"Unverifiable claim\"\n\nLOGICAL GAPS:\n- Identify missing steps in reasoning\n- Note unsupported jumps in logic\n- Acknowledge contradictions if present\n\nRESPONSE:\n[Provide actual answer incorporating above analysis]\n\nDo not fill in confidence percentages or make up citations. Do not claim abilities you don't have.\n```",
    "gemini": "[ERROR querying gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'Resource exhausted. Please try again later. Please refer to https://cloud.google.com/vertex-ai/generative-ai/docs/error-code-429 for more details.', 'status': 'RESOURCE_EXHAUSTED'}}]",
    "deepseek": "## PART 1: WHAT CAN A PROMPT ACTUALLY DO?\n\n**CAN ACCOMPLISH:**\n*   Instruct the LLM to adopt a specific, structured reasoning process (e.g., step-by-step, pros/cons, explicit assumptions) before generating a final answer.\n*   Instruct the LLM to format its output in a specific, verifiable way (e.g., placing citations in a consistent format like `[Source #]`).\n*   Instruct the LLM to explicitly state its level of certainty or note when information is outside its knowledge cutoff.\n*   Instruct the LLM to break down complex queries into sub-questions and address them sequentially.\n*   Instruct the LLM to avoid speculative language when factual answers are requested.\n*   Instruct the LLM to prioritize clarity, conciseness, and completeness based on defined criteria.\n\n**CANNOT ACCOMPLISH:**\n*   Guarantee factual correctness or logical validity. The LLM cannot \"know\" truth; it predicts text.\n*   Access, retrieve, or verify information from external sources (databases, the internet, proprietary documents) without an integrated Retrieval-Augmented Generation (RAG) or tool-use system.\n*   Provide genuine citations to real, external sources without an integrated RAG or tool-use system. It can only mimic citation formats for information in its training data, which is unverifiable and often hallucinated.\n*   Perform independent verification or fact-checking of its own outputs.\n*   Maintain persistent memory or context beyond its defined context window without an external system.\n*   Execute code or run logical proofs to verify its reasoning without an integrated code interpreter or symbolic logic engine.\n\n## PART 2: MINIMAL VIABLE SOLUTION\n\n**The simplest effective prompt:**\n1.  **For Logic:** Mandate a \"Chain-of-Thought\" instruction. Require the LLM to show its reasoning steps explicitly before delivering a final answer. This makes errors detectable.\n2.  **For Citations:** Mandate a clear format for any referenced information (e.g., `[Source: Knowledge Base]`). Crucially, require a disclaimer stating that without an external retrieval system, citations refer to the model's internal training data and cannot be verified.\n3.  **For Output Quality:** Define concrete quality criteria (completeness, structure, clarity) and require the LLM to self-assess its output against these criteria before finalizing.\n\n## PART 3: PRD FORMAT\n\n**Product Requirements Document: LLM Output Integrity System**\n\n**1. Problem Statement**\nUsers cannot trust LLM outputs due to potential logical errors, unverifiable \"citations,\" and inconsistent quality. A system is needed to improve logical robustness, source verifiability, and output reliability.\n\n**2. User Stories**\n*   As a researcher, I need the LLM to show its reasoning steps so I can validate its logic.\n*   As a professional, I need any factual claim to be traceable to a retrievable source document so I can verify it.\n*   As a content creator, I need the LLM to consistently produce outputs that meet a defined standard of completeness and clarity.\n\n**3. Functional Requirements (System-Level)**\n*   **FR1: Structured Reasoning Engine**\n    *   The system shall require the LLM to generate an explicit reasoning chain prior to the final answer for all non-trivial queries.\n    *   The system shall parse and present this reasoning chain separately from the final answer.\n*   **FR2: Verified Citation System**\n    *   The system shall integrate a Retrieval-Augmented Generation (RAG) pipeline.\n    *   The system shall, upon a user query, first retrieve relevant context from a designated, trusted source database.\n    *   The system shall instruct the LLM to base its answer solely on the provided retrieved context.\n    *   The system shall require the LLM to cite claims using unique identifiers (e.g., `[Doc1]`) that map directly to the retrieved source chunks.\n*   **FR3: Output Quality Gate**\n    *   The system shall define a checklist of output quality criteria (e.g., \"Answers the core question,\" \"Is structured logically,\" \"Uses clear language\").\n    *   The system shall require the LLM to perform a final pass over its own output, explicitly stating how it meets each defined criterion.\n    *   The system shall allow users to define custom quality checklists.\n\n**4. Non-Functional Requirements**\n*   **Performance:** The total response time (retrieval + generation) shall not exceed 150% of the base LLM response time for a similar query.\n*   **Reliability:** The RAG system shall have >99% uptime for source retrieval.\n*   **Security:** Source databases for retrieval must be access-controlled and auditable.\n*   **Transparency:** All system components (retrieved context, reasoning chain, self-assessment) must be visible to the end-user.\n\n**5. Acceptance Criteria**\n*   **AC1 (Logic):** For a set of 100 logic puzzles, the system's explicit reasoning chain allows a human reviewer to identify the exact step where an error occurs (if any) in 95% of incorrect answers.\n*   **AC2 (Citations):** 100% of citations (`[DocX]`) in outputs are machine-verifiable and link to the exact text chunk in the source database that supports the claim.\n*   **AC3 (Quality):** When assessed by human reviewers, outputs generated with the quality gate enabled are rated \"sufficiently complete and clear\" 20% more often than baseline outputs.\n\n**6. Out of Scope**\n*   Guaranteeing 100% factual correctness of the LLM's synthesis.\n*   Verifying the ultimate truth of source documents in the retrieval database.\n*   Real-time fact-checking against the live internet.\n*   Teaching the LLM new logical rules or knowledge outside of provided context.\n\n**7. Dependencies**\n*   A low-latency, high-recall embedding model and vector database for the RAG system.\n*   A curated, trusted source database for retrieval.\n*   An LLM API capable of following complex, structured prompts.\n\n## PART 4: THE ACTUAL PROMPT\n\n**Instructions for the LLM:**\n\nYou are a text generation model. Follow this process precisely for every response.\n\n**1. Process the Query.**\n*   If the query is complex, ambiguous, or requires multi-step logic, you MUST proceed to Step 2.\n*   If the query is simple and factual, and you are operating **without a verified retrieval system**, you MUST state this limitation before answering. Proceed to Step 4.\n\n**2. Generate Explicit Reasoning.**\n*   Under a header `## Reasoning`, detail your step-by-step logic.\n*   List any assumptions you are making.\n*   Identify potential uncertainties or missing information.\n*   This section is for your working process. Do not present final conclusions here.\n\n**3. (EXTERNAL SYSTEM REQUIRED) If a verified retrieval system provides source documents:**\n*   Base your answer **only** on the provided context.\n*   For any specific claim, cite the relevant document ID like this: `[Source: DocID]`.\n*   If the context does not contain information needed to answer, state: \"The provided sources do not contain information to answer this query.\"\n\n**4. Produce Final Answer.**\n*   Under a header `## Final Answer`, provide a direct, clear, and complete response to the original query.\n*   If you used sources, cite them as specified in Step 3.\n*   If you are **not** using a verified retrieval system, you must append this note to your final answer: `[Note: This response is generated from the model's internal knowledge. Specific citations to verifiable external sources require a retrieval system.]`\n\n**5. Self-Assess.**\n*   Under a header `## Self-Assessment`, answer these questions:\n    *   Does the Final Answer directly address the core question? (Yes/No/Partially)\n    *   Is the information structured logically? (Yes/No)\n    *   Is the language clear and unambiguous? (Yes/No)\n    *   If sources were required, are all key claims cited? (Yes/No/N/A)\n\n**Do not role-play. Do not add flavor text. Execute these steps functionally.**",
    "grok": "### PART 1: WHAT CAN A PROMPT ACTUALLY DO?\n\n**What a Prompt CAN Accomplish:**\n- Guide the LLM to structure responses in a logical, step-by-step manner by explicitly instructing it to outline reasoning processes.\n- Encourage the LLM to prioritize verifiable information by requesting references to well-known sources or flagging unverified claims.\n- Instruct the LLM to self-check for contradictions or gaps in reasoning within its response before finalizing output.\n- Request output in a specific format (e.g., bullet points, numbered steps) to improve clarity and readability.\n- Direct the LLM to focus on precision and avoid overgeneralizations by asking for specific examples or data points when applicable.\n\n**What a Prompt CANNOT Accomplish:**\n- Guarantee factual accuracy or access to real-time data since the LLM’s knowledge is limited to its training cutoff and it cannot independently verify information.\n- Provide strict citations with verifiable links or primary source references unless integrated with an external search or database system.\n- Ensure high-quality output in domains requiring expertise beyond its training data (e.g., cutting-edge research or highly specialized fields).\n- Self-correct or improve its core reasoning algorithms, as these are inherent to the model’s architecture and training, not modifiable via prompt.\n- Detect or resolve biases in its responses without external feedback or validation systems.\n\n### PART 2: MINIMAL VIABLE SOLUTION\n\n**Simplest Effective Prompt to Improve Logic, Citation Accuracy, and Output Reliability:**\n\n- **Logic Quality:** Instruct the LLM to break down reasoning into clear, numbered steps and flag any assumptions or uncertainties in the response.\n- **Citation Accuracy:** Request the LLM to specify the type of source (e.g., academic paper, news article) it is basing information on, even if it cannot provide direct links, and to note when information is speculative or unverified.\n- **Output Reliability:** Direct the LLM to avoid speculative language, stick to well-established information within its training data, and indicate when a topic may require external expertise or updated data.\n\nThis approach focuses on transparency and structured thinking rather than unattainable guarantees of accuracy or external validation.\n\n### PART 3: PRD FORMAT\n\n**Product Requirements Document (PRD)**\n\n**Problem Statement:**\nUsers require an LLM system that delivers logically sound responses, transparent and strict citation practices, and reliable high-quality output, addressing current limitations in reasoning coherence, source attribution, and content trustworthiness.\n\n**User Stories:**\n- As a user, I want the LLM to explain its reasoning step by step so I can trust its logic.\n- As a user, I want the LLM to clearly indicate the basis for its information so I can assess its credibility.\n- As a user, I want the LLM to produce reliable output by avoiding speculation and flagging areas of uncertainty.\n\n**Functional Requirements:**\n1. The system must structure responses to include step-by-step reasoning for complex answers or conclusions.\n2. The system must indicate the type or nature of sources (e.g., academic, anecdotal) for factual claims and flag unverified or speculative information.\n3. The system must prioritize well-established information from its training data and avoid speculative or unverified claims unless explicitly requested.\n4. The system must flag topics or questions that may require external expertise or real-time data beyond its training cutoff.\n5. [EXTERNAL SYSTEM REQUIRED] Integrate with a real-time search or database API to provide verifiable citations and links to primary sources when available.\n\n**Non-Functional Requirements:**\n- Responses must be generated within standard LLM latency constraints (e.g., under 5 seconds for typical queries).\n- Output must remain concise, avoiding unnecessary verbosity while meeting functional requirements.\n- The system must operate within existing LLM architectural limits, relying on prompts for behavior modification rather than model retraining.\n\n**Acceptance Criteria:**\n- For logic quality: Given a query requiring reasoning (e.g., solving a problem), the response must include at least 3 numbered steps explaining the thought process, with no logical contradictions identified in manual review.\n- For citation accuracy: Given a factual query, the response must specify the type of source (e.g., “based on general knowledge from academic texts”) for at least 80% of claims and flag speculative content with phrases like “this is unverified.”\n- For output reliability: Given a query on a specialized or recent topic, the response must include a disclaimer about potential limitations (e.g., “this information may be outdated”) in at least 90% of applicable cases.\n- For external system integration (if implemented): Given a factual query, the response must include at least one verifiable link or reference from a search API in at least 70% of cases where such data exists.\n\n**Out of Scope:**\n- Retraining or modifying the underlying LLM architecture to improve core reasoning or factual accuracy.\n- Guaranteeing 100% factual correctness or eliminating all biases, as these are inherent to the model’s training data.\n- Providing real-time data or primary source citations without an external system integration.\n\n**Dependencies:**\n- External search API or database system for verifiable citations and real-time data access (if implemented).\n- Human review or feedback loop for validating output quality during testing phases.\n\n### PART 4: THE ACTUAL PROMPT\n\n**Prompt for LLM Use:**\n\n“Respond to the following query with a clear and structured answer. Follow these instructions strictly:\n\n1. Break down your reasoning into numbered steps, ensuring each step logically follows the previous one. If there are assumptions or uncertainties, explicitly state them as ‘Assumption: [detail]’ or ‘Uncertainty: [detail].’\n2. For any factual claims, specify the type of source your information is based on (e.g., ‘based on general knowledge from academic texts’ or ‘based on widely reported news’). If the claim is speculative or unverified, state ‘This is unverified’ or ‘This is speculative.’\n3. Stick to well-established information within your training data. Avoid speculation unless explicitly requested. If the topic may require expertise beyond your data or real-time information, include a disclaimer such as ‘This information may be outdated’ or ‘This topic may require external expertise.’\n4. Keep the response concise and focused, avoiding unnecessary elaboration.\n\nQuery: [Insert user query here]”\n\n**Note on Limitations:**\n- This prompt cannot guarantee factual accuracy or provide verifiable citations without an external system. For strict citations with links, an EXTERNAL SYSTEM REQUIRED (e.g., search API integration) must be implemented to fetch and validate sources in real time.",
    "mistral": "### **PART 1: WHAT CAN A PROMPT ACTUALLY DO?**\n\n#### **CAN DO (Prompt-Level Improvements)**\n1. **Enforce structured reasoning steps** – Require explicit, sequential logic (e.g., \"First, state assumptions. Then, derive conclusions.\").\n2. **Mandate citation format** – Require citations in a strict, verifiable format (e.g., \"[Author, Year, Page]\" with external links if possible).\n3. **Require disclaimers for uncertainty** – Force the model to flag speculative or unverified claims.\n4. **Constrain output format** – Enforce a rigid structure (e.g., \"Answer in bullet points, then provide citations, then list limitations.\").\n5. **Demand self-critique** – Require the model to list potential flaws in its own reasoning.\n6. **Limit scope of claims** – Restrict assertions to what can be directly supported by provided context.\n7. **Require external verification flags** – Force the model to state when a claim requires external fact-checking.\n\n#### **CANNOT DO (Requires External Systems)**\n1. **Verify citations in real-time** – The model cannot check if a source actually supports a claim without external tools.\n2. **Access up-to-date or proprietary databases** – The model’s knowledge is static unless integrated with live search.\n3. **Perform mathematical or logical proofs beyond its training** – It can simulate reasoning but cannot guarantee correctness without external validation.\n4. **Detect hallucinations autonomously** – It cannot self-audit for factual errors without external grounding.\n5. **Guarantee originality** – It cannot ensure outputs are not derived from training data without plagiarism detection tools.\n6. **Adapt to user-specific knowledge** – It cannot dynamically adjust for a user’s expertise level without explicit input.\n\n---\n\n### **PART 2: MINIMAL VIABLE SOLUTION**\n\n**Prompt Structure:**\n1. **Reasoning:** Require step-by-step logic with explicit assumptions.\n2. **Citations:** Demand direct quotes or structured references (e.g., \"[Source, Page]\") with external links if possible.\n3. **Uncertainty Flags:** Force the model to label speculative claims.\n4. **Self-Critique:** Require a \"Limitations\" section listing potential flaws.\n\n**Example:**\n```\n1. Answer the question in bullet points.\n2. For each claim, provide a citation in the format: \"[Author, Year, Page: Quote]\". If no citation is available, write \"[NO CITATION]\".\n3. After the answer, list all assumptions made.\n4. After assumptions, list potential flaws in the reasoning.\n5. If any claim cannot be verified, label it \"[REQUIRES EXTERNAL VERIFICATION]\".\n```\n\n---\n\n### **PART 3: PRD FORMAT**\n\n#### **Problem Statement**\nUsers need LLM outputs that are logically rigorous, strictly cited, and reliably accurate—not just superficially plausible.\n\n#### **User Stories**\n1. As a researcher, I need claims to be traceable to verifiable sources so I can trust the output.\n2. As a decision-maker, I need logical steps to be explicit so I can audit the reasoning.\n3. As a fact-checker, I need the model to flag unverified claims so I can validate them externally.\n\n#### **Functional Requirements**\n1. **Structured Reasoning**\n   - Outputs must include explicit assumptions, logical steps, and conclusions.\n   - Must flag speculative or unverified claims.\n2. **Strict Citations**\n   - All claims must be paired with citations in a standardized format.\n   - Citations must include direct quotes or page numbers where possible.\n3. **Self-Critique**\n   - Outputs must include a \"Limitations\" section listing potential flaws.\n4. **External Verification Integration (EXTERNAL SYSTEM REQUIRED)**\n   - Must interface with a citation-verification tool to validate references.\n   - Must interface with a fact-checking API to flag unverified claims.\n\n#### **Non-Functional Requirements**\n1. **Performance**\n   - Must not increase response latency by >20% compared to baseline.\n2. **Constraints**\n   - Must work within the LLM’s token limits.\n   - Must not require real-time internet access (unless external systems are integrated).\n\n#### **Acceptance Criteria**\n1. **Logic Quality**\n   - 90% of outputs must pass a human audit for logical consistency.\n2. **Citation Accuracy**\n   - 95% of citations must be verifiable when checked against sources.\n3. **Output Reliability**\n   - 80% of outputs must correctly flag unverified claims.\n\n#### **Out of Scope**\n1. Real-time fact-checking (requires external systems).\n2. Guaranteed originality (requires plagiarism detection tools).\n3. Dynamic knowledge updates (requires live search integration).\n\n#### **Dependencies**\n1. **Citation Verification Tool** – To validate references.\n2. **Fact-Checking API** – To cross-reference claims.\n3. **User Feedback Loop** – To improve accuracy over time.\n\n---\n\n### **PART 4: THE ACTUAL PROMPT**\n\n```\n**Instructions:**\n1. Answer the question in bullet points.\n2. For each claim, provide a citation in the format:\n   - \"[Author, Year, Page: Direct Quote]\" (if available)\n   - \"[Author, Year]\" (if no page/quote available)\n   - \"[NO CITATION]\" (if no source exists)\n3. After the answer, list all assumptions made.\n4. After assumptions, list potential flaws in the reasoning.\n5. If any claim cannot be verified, label it \"[REQUIRES EXTERNAL VERIFICATION]\".\n\n**Example Output:**\n- Claim 1: [Citation]\n- Claim 2: [Citation]\n**Assumptions:**\n- Assumption 1\n- Assumption 2\n**Limitations:**\n- Limitation 1\n- Limitation 2\n\n**EXTERNAL SYSTEM REQUIRED:**\n- Citations must be validated by an external tool.\n- Unverified claims must be flagged for human review.\n```\n\n**No theater. No roleplay. Just functional constraints.**"
  }
}